app/controllers/installations_controller.rb

  def index
    installations = Installation.all
    if params[:installation_ids]
      installations = installations.where(id: params[:installation_ids])
---
SELECT "installations".* FROM "installations"
SELECT "installations".* FROM "installations" WHERE "installations"."id" IN (2, 89)