app/controllers/tours_controller.rb

  def show
    render json: Tour.find(params[:id])
---
SELECT  "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    tour = Tour.new(tour_params)
    if tour.save
---
INSERT INTO "tours" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-08-04 22:05:48.553147"], ["updated_at", "2015-08-04 22:05:48.553147"]]